<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5cff5dd52c1375ac285ba082f57a9ec4c51fd8ca82f8ae00b814b99fbe4693b6","plan_job_ref":"Job Terraform Plan #565 at https://github.com/cal-itp/data-infra/actions/runs/18207334695","plan_out_hash":"78d16076d96603f000b8eb192a30d72966a04efe56435064d92265d885fd5e93","plan_hash":"bdef5b80f8d9a7e9d29e1566dd4560360e23266ba69aebea8db5794643bb748d","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/sentinel/us__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_logging_organization_sink.sentinel-organization-sink[0] will be created
+   resource "google_logging_organization_sink" "sentinel-organization-sink" {
+       destination        = "pubsub.googleapis.com/projects/cal-itp-data-infra/topics/sentinel-topic"
+       filter             = "protoPayload.serviceName=iam.googleapis.com"
+       id                 = (known after apply)
+       include_children   = true
+       intercept_children = false
+       name               = "IAM-logs-organization-sentinel-sink"
+       org_id             = "************"
+       writer_identity    = (known after apply)

+       bigquery_options (known after apply)
    }

  # google_project_iam_binding.log-writer-organization[0] will be created
+   resource "google_project_iam_binding" "log-writer-organization" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       members = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/pubsub.publisher"
    }

  # google_pubsub_subscription.sentinel-subscription will be created
+   resource "google_pubsub_subscription" "sentinel-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = {
+           "goog-terraform-provisioned" = "true"
        }
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "sentinel-subscription-IAMlogs"
+       project                    = "cal-itp-data-infra"
+       terraform_labels           = {
+           "goog-terraform-provisioned" = "true"
        }
+       topic                      = "sentinel-topic"

+       expiration_policy (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #565](https://github.com/cal-itp/data-infra/actions/runs/18207334695)